InformationRegisters/ЧерныйСписокКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ЧерныйСписокКонтрагентов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЧерныйСписокКонтрагентов/Ext/ManagerModule.bsl
Функция ПолучитьВхождениеКонтрагента(Контрагент) Экспорт
	
	Возврат (РегистрыСведений.ЧерныйСписокКонтрагентов.ПолучитьПоследнее( , Новый Структура("Контрагент", Контрагент.Ссылка)).Актуальность = Истина);
	
КонецФункции // ПолучитьВхождениеКонтрагента()

Функция ПолучитьОписаниеВхожденияКонтрагента(Контрагент) Экспорт
	
	Результат = Новый Структура("Актуальность,Период,Комментарий");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЧерныйСписокКонтрагентовСрезПоследних.Актуальность,
	                      |	ВЫБОР
	                      |		КОГДА ЧерныйСписокКонтрагентовСрезПоследних.Актуальность
	                      |			ТОГДА ЧерныйСписокКонтрагентовСрезПоследних.Период
	                      |		ИНАЧЕ NULL
	                      |	КОНЕЦ КАК Период,
	                      |	ВЫБОР
	                      |		КОГДА ЧерныйСписокКонтрагентовСрезПоследних.Актуальность
	                      |			ТОГДА ЧерныйСписокКонтрагентовСрезПоследних.Регистратор.Комментарий
	                      |		ИНАЧЕ NULL
	                      |	КОНЕЦ КАК Комментарий
	                      |ИЗ
	                      |	РегистрСведений.ЧерныйСписокКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК ЧерныйСписокКонтрагентовСрезПоследних");
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать(); Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Результат.Актуальность = (Результат.Актуальность = Истина);
	Результат.Комментарий = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеНаименование(Результат.Комментарий, НСтр("ru = 'Не указана'; uk = 'Не вказана'"));
	
	Возврат Результат;
	
КонецФункции // ПолучитьОписаниеВхожденияКонтрагента()
